package com.javarush.task.task05.task0528;

/* 
Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".


*/

public class Solution {
    public static void main(String[] args) {
        System.out.println(16+" "+12+" "+2019);
        //напишите тут ваш код
    }
}
