package com.javarush.task.task04.task0431;

/* 
От 10 до 1
Вывести на экран числа от 10 до 1 используя цикл while. Каждое значение с новой строки.


*/

public class Solution {
    public static void main(String[] args) {
        int i=10;
        while (i>0){
            System.out.println(i);
            i--;
        }
        //напишите тут ваш код

    }
}
